import json

menu = {"日替定食":510,"アラカルト丼":380,"アラカルト丼（大盛り）":440,
        "親子丼":370,"親子丼（大盛り）":430,
        "玉子丼":310,"玉子丼（大盛り）":370,
        "月見うどん":250,"月見うどん（大盛り）":310,
        "カツ丼":420,"カツ丼（大盛り）":480,
        "カレーライス":370,"カレーライス（大盛り）":430,
        "カツカレー":470,"カツカレー（大盛り）":530,
        "チャーハン":320,"チャーハン（大盛り）":420,
        "かけうどん":200,"かけうどん（大盛り）":300,
        "かけそば":200,"かけそば（大盛り）":300,
        "きつねうどん":250,"きつねうどん（大盛り）":350,
        "きつねそば":250,"きつねそば（大盛り）":350,
        "カレーうどん":370,"カレーうどん（大盛り）":470,
        "ラーメン":310,"ラーメン（大盛り）":410,
        "納豆":100,"卵":50,"味噌汁":50,
        "ライス（中）":150,"ライス（小）":100,"漬物":50}

with open("data.json", "w") as file:
    json.dump(menu, file)